[
  {
    "id": "9084986f-456c-449b-ae6e-59ef1f26b129",
    "title": "CSS en profondeur",
    "author": "Keith J. Grant",
    "genre": "Développement Web",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_zIgYlIxcY.png",
    "coverColor": "#1e2a4b",
    "description": "« CSS en profondeur » de Keith J. Grant est un guide complet pour les développeurs web souhaitant aller au-delà des bases du CSS et maîtriser les subtilités de la mise en forme des pages web. Ce livre est conçu pour des développeurs intermédiaires à avancés qui connaissent déjà le CSS, mais qui désirent approfondir leur compréhension et exploiter tout son potentiel.",
    "totalCopies": 18,
    "availableCopies": 16,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_O-O0Z_Vz5.png",
    "summary": "« CSS en profondeur » commence par passer en revue les principes de base du CSS, puis évolue rapidement vers des concepts plus avancés. Grant souligne l'importance de comprendre le fonctionnement sous-jacent des propriétés CSS telles que la mise en page, le modèle de boîte et le positionnement. Les lecteurs apprennent à utiliser ces outils de manière plus efficace, rendant leur code plus prévisible et plus facile à déboguer.\n\nLe livre consacre également beaucoup de temps à l'étude des systèmes de mise en page modernes, notamment Flexbox et CSS Grid, qui permettent de créer des designs complexes et responsives avec un minimum de code. Grant explique comment les utiliser dans différents contextes à l'aide d'exemples concrets.\n\nUn des points forts du livre est sa couverture approfondie des animations et des transitions, montrant comment ajouter des effets dynamiques aux pages web sans recourir à JavaScript. Cela permet de concevoir des interfaces interactives et fluides.\n\nEnfin, le livre aborde également les préprocesseurs CSS et des méthodologies comme BEM, en enseignant aux développeurs comment organiser leurs feuilles de style pour des projets de grande envergure tout en appliquant les bonnes pratiques (DRY et modularité)."
  },
  {
    "id": "350c3bc8-a5cc-45a3-ba16-97b93ed056b0",
    "title": "HTML et CSS : Concevez et réalisez des sites web",
    "author": "Jon Duckett",
    "genre": "Développement Web",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_1pCoBDI11.png",
    "coverColor": "#3a2931",
    "description": "Que vous soyez un débutant complet ou que vous souhaitiez rafraîchir vos connaissances en HTML et CSS, ce livre offre une base solide et des compétences pratiques immédiatement applicables à des projets concrets.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_MONyhmpr4V.png",
    "summary": "« HTML et CSS : Concevez et réalisez des sites web » commence par une introduction à HTML, en couvrant les éléments de base d'une page web tels que les titres, les paragraphes, les liens et les images. Duckett explique avec soin la structure et la syntaxe de HTML, enseignant aux lecteurs comment rédiger et organiser leur code.\n\nLe livre passe ensuite à CSS, montrant comment appliquer des styles aux éléments HTML. Les sujets abordés incluent les polices, les couleurs, les bordures, le padding et les marges, le tout présenté de manière claire à l'aide d'exemples visuels permettant d'en observer l'impact immédiat.\n\nAu fil de l'ouvrage, les lecteurs approfondissent les techniques de mise en page (modèle de boîte, positionnement, flottants et mises en page flexibles via Flexbox) et découvrent le concept de design réactif pour adapter les sites aux différents écrans et dispositifs.\n\nDe nombreux conseils pratiques et techniques sont proposés pour créer des sites web à la fois beaux et fonctionnels, faisant de ce livre un guide idéal pour démarrer dans le développement web."
  },
  {
    "id": "b514f922-a715-45ec-846e-e51d40e15aa2",
    "title": "Entretien de conception de systèmes",
    "author": "Alex Xu",
    "genre": "Conception de systèmes",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_CmVaNeXrQ.png",
    "coverColor": "#363b63",
    "description": "« Entretien de conception de systèmes : Le guide d'un initié » d'Alex Xu est un ouvrage indispensable pour les ingénieurs logiciels et professionnels se préparant aux entretiens de conception. Il offre une vue détaillée des principes et techniques nécessaires pour exceller dans ces entretiens, souvent cruciaux dans le processus de recrutement des grandes entreprises technologiques.",
    "totalCopies": 10,
    "availableCopies": 10,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_x_vGP6M7Y.png",
    "summary": "Le livre débute en présentant les concepts clés de la conception de systèmes, en insistant sur l'importance de comprendre les exigences, l'évolutivité et la fiabilité. Xu explique comment aborder un problème ouvert en le décomposant en parties plus petites et gérables.\n\nIl aborde ensuite des sujets essentiels tels que la conception de bases de données, le caching, la répartition de charge et les files d'attente de messages, tout en explorant la conception de systèmes à haute disponibilité (réplication, partitionnement, sharding).\n\nÀ travers divers exemples concrets allant de la création d'un service de raccourcissement d'URL à la mise en place d'un système de recommandation, le livre offre une analyse approfondie des compromis en termes de performance, coût et maintenabilité.\n\nXu insiste également sur l'importance de la communication lors des entretiens, expliquant comment présenter et justifier ses choix, ce qui fait de cet ouvrage une ressource essentielle pour réussir un entretien de conception."
  },
  {
    "id": "b4ed06bf-02b2-42c4-8886-b3847af02cca",
    "title": "L'essentiel de l'informatique",
    "author": "Wladston Ferreira Filho",
    "genre": "Informatique",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_ZRyGl0A75A.png",
    "coverColor": "#73d173",
    "description": "« L'essentiel de l'informatique » de Wladston Ferreira Filho est une introduction concise et accessible aux concepts fondamentaux de l'informatique. Conçu pour les débutants et ceux qui souhaitent renforcer leurs compétences en résolution de problèmes, ce livre décompose des sujets complexes en éléments faciles à assimiler.",
    "totalCopies": 89,
    "availableCopies": 87,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_W6XGeHaEO.png",
    "summary": "L'ouvrage commence par expliquer l'art de résoudre des problèmes en informatique, en insistant sur l'importance de décomposer les problèmes en parties gérables. Il présente des concepts clés tels que l'abstraction, les algorithmes et l'analyse de la complexité.\n\nLe livre explore ensuite diverses structures de données (tableaux, listes chaînées, piles, files d'attente, arbres) avec des explications claires et des aides visuelles, afin d'aider le lecteur à choisir la structure la plus adaptée à chaque situation.\n\nLe raisonnement logique et la conception d'algorithmes occupent une place centrale, avec des chapitres consacrés au tri, à la recherche et à la récursion, tout en soulignant l'importance des compromis (temps versus espace mémoire).\n\nEnfin, des techniques pratiques de résolution de problèmes sont présentées à travers des exercices interactifs, permettant aux lecteurs de consolider leurs acquis et de penser comme de véritables programmeurs."
  },
  {
    "id": "dc73abc1-8699-4e0a-91b0-a67e80292b9c",
    "title": "L'art du langage d'assemblage",
    "author": "Randall Hyde",
    "genre": "Programmation",
    "rating": 3,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_lZrAopUNM.png",
    "coverColor": "#fff9bf",
    "description": "« L'art du langage d'assemblage » de Randall Hyde est une introduction complète et captivante à la programmation en langage assembleur. Réputé pour sa clarté et sa profondeur, ce livre offre aux lecteurs une base solide en programmation bas-niveau, essentielle pour comprendre le fonctionnement interne des ordinateurs.",
    "totalCopies": 78,
    "availableCopies": 78,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_VGtFawJik.png",
    "summary": "Le livre introduit les fondamentaux de la programmation en assembleur en présentant une vue d'ensemble de l'architecture des ordinateurs et en expliquant comment les CPU traitent les instructions et gèrent les données.\n\nIl passe ensuite à la programmation pratique en abordant la représentation des données et la gestion de la mémoire, montrant comment les entiers, les nombres à virgule flottante et d'autres types sont stockés et manipulés au niveau binaire. L'utilisation de HLA permet de rendre ces concepts plus accessibles.\n\nLes structures de contrôle (boucles, conditions, fonctions) sont détaillées pour offrir une compréhension approfondie de la traduction du code de haut niveau en instructions machine.\n\nEnfin, des sujets avancés comme l'optimisation, les interactions avec le matériel et la programmation système sont abordés, avec de nombreux exercices et exemples concrets pour renforcer l'apprentissage."
  },
  {
    "id": "17a58b62-0258-45a5-8b8b-9a21a6d6630c",
    "title": "Un logiciel vraiment de qualité",
    "author": "Marco Faella",
    "genre": "Programmation",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_YiFXdp5P_T.png",
    "coverColor": "#061e20",
    "description": "Ce livre est parfait pour les développeurs souhaitant aller au-delà de la simple fonctionnalité pour rendre leur code robuste et professionnel. Écrit dans un style accessible, « Seriously Good Software » comble le fossé entre théorie et application pratique.",
    "totalCopies": 45,
    "availableCopies": 45,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_LhwRi_a9cJ.png",
    "summary": "« Seriously Good Software » explore d'abord les principes fondamentaux du développement logiciel en insistant sur la nécessité d’un logiciel correct, c'est-à-dire fonctionnant comme prévu en toutes circonstances. Faella illustre avec des exemples clairs comment identifier et corriger les erreurs qui pourraient compromettre la fiabilité du code.\n\nLe livre aborde ensuite la lisibilité du code, montrant comment un code propre et bien documenté favorise la collaboration et réduit les coûts de maintenance. Des techniques de refactorisation sont proposées afin d'améliorer la clarté sans altérer la fonctionnalité.\n\nLes aspects de performance et d'évolutivité sont traités par des conseils pratiques pour optimiser le code face à une charge croissante, grâce notamment à l'utilisation d'outils de profilage et à l'optimisation des algorithmes.\n\nLa sécurité est également abordée, avec des méthodes pour protéger le logiciel contre les vulnérabilités, tandis que la maintenabilité est traitée par des conseils pour écrire un code modulaire et testable.\n\nEn résumé, ce livre allie théorie et exemples pratiques pour permettre aux développeurs de créer des logiciels non seulement fonctionnels, mais aussi pérennes et performants."
  },
  {
    "id": "91445e57-01a8-4e1e-bb18-cf04b3a0b7d1",
    "title": "Fondamentaux des systèmes de bases de données",
    "author": "Ramez Elmasri et Shamkant B. Navathe",
    "genre": "Informatique",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_9-sl0Jo8y.png",
    "coverColor": "#ffffff",
    "description": "« Fondamentaux des systèmes de bases de données » de Ramez Elmasri et Shamkant B. Navathe est un manuel complet qui constitue une pierre angulaire pour comprendre les systèmes de bases de données et leurs applications. L'ouvrage est largement utilisé tant dans le milieu académique qu'industriel pour enseigner les concepts fondamentaux et avancés des bases de données.",
    "totalCopies": 145,
    "availableCopies": 145,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_UZULgWXVA.png",
    "summary": "Le livre débute en présentant les concepts fondamentaux des systèmes de bases de données – leur objectif, leur architecture et leur rôle dans l'informatique moderne – et expose des techniques de modélisation des données telles que le modèle Entité-Relation (ER).\n\nIl explore en profondeur la théorie des bases de données relationnelles (algèbre relationnelle, SQL) et aborde les principes de conception, notamment la normalisation, afin d'éliminer la redondance et de préserver l'intégrité des données.\n\nDes sujets plus avancés, comme le traitement des transactions (contrôle de concurrence, mécanismes de récupération), les bases de données distribuées et les technologies émergentes (NoSQL, big data), sont également traités.\n\nLe livre complète chaque chapitre avec des exercices, des études de cas et des exemples concrets, fournissant ainsi une vision globale et pratique de la gestion des bases de données."
  },
  {
    "id": "c3f2ff59-a3c2-47d2-a793-93457a9dccf7",
    "title": "Concepts des systèmes d'exploitation",
    "author": "Abraham Silberschatz, Peter B. Galvin et Greg Gagne",
    "genre": "Informatique",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_W6Bz0KiBC.png",
    "coverColor": "#0e0e10",
    "description": "« Concepts des systèmes d'exploitation », souvent surnommé le « Dinosaur Book », est un guide définitif pour comprendre le fonctionnement interne des systèmes d'exploitation. Écrit par Abraham Silberschatz, Peter B. Galvin et Greg Gagne, cet ouvrage est une ressource essentielle pour les étudiants, enseignants et professionnels de l'informatique.",
    "totalCopies": 97,
    "availableCopies": 97,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_rkMFYr5J0.png",
    "summary": "Ce livre offre une exploration approfondie des systèmes d'exploitation, en commençant par une introduction à leur rôle fondamental dans l'informatique. Il décrit comment les systèmes gèrent les ressources matérielles (processeur, mémoire, stockage) pour assurer un fonctionnement efficace et fiable.\n\nLes thèmes clés incluent la gestion des processus et des threads (multitâche, concurrence), avec des explications sur les algorithmes d'ordonnancement, la synchronisation et la gestion des interblocages.\n\nLa gestion de la mémoire est également détaillée, avec des discussions sur la pagination, la segmentation et la mémoire virtuelle, ainsi que sur les systèmes de fichiers et les structures de stockage.\n\nDes sujets avancés tels que la sécurité, la protection et les systèmes distribués sont abordés, tout comme les développements modernes (virtualisation, cloud computing), permettant aux lecteurs d'acquérir une compréhension complète et pratique du domaine."
  },
  {
    "id": "fe03e013-53b8-4574-9ca8-caec69a9b16c",
    "title": "Algorithmes",
    "author": "Robert Sedgewick et Kevin Wayne",
    "genre": "Informatique",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_dr-f_LPwA.png",
    "coverColor": "#bf1e2e",
    "description": "« Algorithmes » par Robert Sedgewick et Kevin Wayne est un guide complet et faisant autorité pour comprendre les algorithmes et leur rôle dans l'informatique moderne. Considéré comme un texte fondamental, l'ouvrage couvre une vaste gamme d'algorithmes, du tri et de la recherche au traitement des graphes et à la manipulation de chaînes.",
    "totalCopies": 321,
    "availableCopies": 318,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KSZGUHg5R.png",
    "summary": "« Algorithmes » propose une exploration approfondie des principes algorithmiques et de leurs applications. Il débute avec les bases en présentant des algorithmes élémentaires tels que le tri et la recherche, en expliquant leur importance pour une gestion efficace des données.\n\nLe livre évolue vers des sujets plus complexes, comme les algorithmes de graphes et le traitement des chaînes, avec des exemples pratiques (connectivité de réseaux, plus courts chemins, arbres couvrants) et une discussion sur la recherche de motifs et l'analyse de textes.\n\nLes authors insistent sur la conception et l'analyse des algorithmes, en mettant l'accent sur l'efficacité, l'évolutivité et en fournissant des outils pour évaluer la performance des solutions.\n\nLa mise en œuvre pratique est également abordée à travers de nombreux exemples de code et exercices, garantissant ainsi un équilibre entre théorie et pratique pour résoudre des problèmes concrets."
  },
  {
    "id": "585df184-991b-4edf-9902-f8531c3a81d9",
    "title": "Le Codeur exemplaire",
    "author": "Robert C. Martin",
    "genre": "Logiciel",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_EE5klEyX0.png",
    "coverColor": "#060709",
    "description": "« Le Codeur exemplaire » de Robert C. Martin est un guide essentiel pour les développeurs de logiciels souhaitant atteindre les plus hauts standards de professionnalisme. Au-delà des compétences techniques, l'ouvrage se concentre sur l'état d'esprit, l'éthique et les pratiques qui définissent un programmeur professionnel.",
    "totalCopies": 35,
    "availableCopies": 35,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_50K9AmWND.png",
    "summary": "Ce livre explore en profondeur les principes et pratiques du développement logiciel professionnel. Il commence par définir ce que signifie être un programmeur professionnel, en soulignant l'importance de prendre ses responsabilités et d'agir avec intégrité. Martin montre que le professionnalisme va bien au-delà des compétences techniques et requiert qualité, discipline et communication efficace.\n\nL'ouvrage met un accent particulier sur la maîtrise des compétences non techniques essentielles, telles que la gestion du temps et l'art de dire « non », en donnant des conseils pratiques pour gérer des attentes irréalistes, prioriser les tâches et maintenir un équilibre sain entre vie personnelle et professionnelle.\n\nIl insiste également sur l'importance de tests rigoureux, de bonnes pratiques de codage et de l'apprentissage continu, en proposant des astuces pour améliorer la qualité du code et gérer des situations stressantes.\n\nEnfin, « Le Codeur exemplaire » encourage à adopter une mentalité d'apprentissage permanent et d'auto-amélioration, servant de guide et d'inspiration pour atteindre l'excellence tant sur le plan technique que professionnel."
  },
  {
    "id": "cea639ce-ee90-4ef9-9fef-c9562a247e99",
    "title": "The Lean Startup",
    "author": "Eric Ries",
    "genre": "Entrepreneuriat",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_XyoNwHCdwe.png",
    "coverColor": "#1E73BE",
    "description": "« The Lean Startup » d'Eric Ries est un guide pour créer et gérer des startups en maximisant l'innovation tout en minimisant les efforts superflus. Il présente la méthodologie Lean Startup, qui consiste à transformer rapidement des idées en produits, les tester auprès de vrais clients et apprendre de leurs retours pour les améliorer.",
    "totalCopies": 17,
    "availableCopies": 17,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_uiRdVQTTm.png",
    "summary": "« The Lean Startup » est un guide pratique pour la création et la gestion de startups. Le livre introduit la boucle de rétroaction Build-Measure-Learn, dans laquelle il est recommandé de développer un produit minimum viable (MVP) afin de tester rapidement les hypothèses. En mesurant la réaction des clients, les entrepreneurs peuvent déterminer s'il faut pivoter ou persévérer.\n\nL'approche met l'accent sur l'expérimentation continue et l'apprentissage validé, en incitant les entrepreneurs à tester leurs idées avec des données concrètes plutôt qu'avec des suppositions.\n\nUn autre aspect clé est le principe de « l'innovation comptable », qui consiste à mesurer les progrès en termes d'apprentissage validé plutôt que par des indicateurs superficiels. Cela permet de suivre des métriques réellement significatives pour l'engagement et la satisfaction des clients.\n\nEn somme, « The Lean Startup » offre une feuille de route pour créer des entreprises agiles et centrées sur le client, en misant sur l'expérimentation rapide, la prise de décision basée sur les données et l'itération constante."
  },
  {
    "id": "68f7c183-b995-4ba3-a644-30110ebb932e",
    "title": "Habitudes atomiques",
    "author": "James Clear",
    "genre": "Développement personnel",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_HOCexO5Ms.png",
    "coverColor": "#ffffff",
    "description": "« Habitudes atomiques » de James Clear explique comment de petits changements dans les habitudes quotidiennes peuvent entraîner des transformations significatives. Clear insiste sur le fait que ces habitudes agissent comme un intérêt composé dans l'amélioration personnelle.",
    "totalCopies": 1200,
    "availableCopies": 1200,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_WyfBbHfTp.png",
    "summary": "« Habitudes atomiques » démontre que de minuscules améliorations quotidiennes (par exemple, une progression de 1 % chaque jour) s'accumulent pour produire des résultats remarquables. Le livre introduit les Quatre Lois du Changement de Comportement – rendre l'habitude évidente, attrayante, facile et satisfaisante – afin de favoriser l'adoption de bonnes habitudes et d'éliminer les mauvaises.\n\nUne idée centrale est l'importance de l'identité : le changement durable survient lorsque l'on se concentre sur qui l'on souhaite devenir plutôt que sur ce que l'on veut atteindre.\n\nLe livre met également en lumière l'influence de l'environnement sur la formation des habitudes, en expliquant comment de simples ajustements dans son cadre de vie peuvent faciliter l'adoption de comportements positifs.\n\nEn définitive, « Habitudes atomiques » rappelle que le succès repose sur la constance des petits pas quotidiens plutôt que sur de grands sauts."
  },
  {
    "id": "b6b9cc5d-95fd-488e-b1df-2a805678b430",
    "title": "React en action",
    "author": "Mark Tielens Thomas",
    "genre": "Développement Web",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_rzjr6TrKF.png",
    "coverColor": "#302428",
    "description": "« React en action » de Mark Tielens Thomas est un guide pratique pour maîtriser React, une bibliothèque JavaScript incontournable pour créer des interfaces utilisateur. Il convient tant aux débutants qu'aux développeurs souhaitant approfondir leur connaissance de l'écosystème React.",
    "totalCopies": 57,
    "availableCopies": 57,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_jO3MUj8-s.png",
    "summary": "Le livre présente d'abord les bases de React (composants, JSX, props, et gestion de l'état) avant d'aborder des notions plus avancées telles que les méthodes de cycle de vie, les hooks et l'optimisation des performances. Il insiste sur la nature déclarative de React qui simplifie la création d'interfaces complexes.\n\nLes lecteurs sont guidés dans la réalisation d'applications réelles, avec des outils essentiels comme Redux, React Router et des frameworks de test tels que Jest et Enzyme, ainsi que l'intégration avec des services backend.\n\nEnfin, l'ouvrage met en avant les meilleures pratiques de développement moderne, en aidant les développeurs à concevoir des composants réutilisables et à déboguer efficacement leur code."
  },
  {
    "id": "8f45a8ad-e0e1-437e-8987-5bcbaca24bd9",
    "title": "JavaScript : Les bonnes parties",
    "author": "Douglas Crockford",
    "genre": "Programmation",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_-xOn0_b32.png",
    "coverColor": "#00a199",
    "description": "« JavaScript : Les bonnes parties » de Douglas Crockford est un guide concis pour comprendre et utiliser les aspects les plus efficaces de JavaScript tout en évitant ses pièges. Il s'adresse aux développeurs souhaitant écrire un code propre, efficace et fiable en se concentrant sur les forces du langage.",
    "totalCopies": 501,
    "availableCopies": 500,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_KOYG_-R2J.png",
    "summary": "Douglas Crockford identifie dans ce livre les « bonnes parties » de JavaScript, telles que sa nature dynamique orientée objet, ses capacités en programmation fonctionnelle et sa simplicité lorsqu'il est utilisé correctement. Il met en garde contre les aspects problématiques (variables globales, coercition des types, comportements incohérents) et recommande de les éviter.\n\nL'ouvrage aborde des thèmes clés comme la syntaxe, les objets, les fonctions, l'héritage, les tableaux et les expressions régulières, tout en proposant des pratiques pour écrire un code maintenable et efficace, illustré par de nombreux exemples pratiques."
  },
  {
    "id": "d125678e-80d7-4ba8-97a6-cc6ee4b980ef",
    "title": "JavaScript Éloquent",
    "author": "Marijn Haverbeke",
    "genre": "Programmation",
    "rating": 5,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_acYPV3jV0.png",
    "coverColor": "#F8D347",
    "description": "« JavaScript Éloquent » de Marijn Haverbeke propose une plongée approfondie dans JavaScript, destinée aux développeurs souhaitant maîtriser le langage. Le livre allie explications claires, exemples pratiques et exercices pour aborder aussi bien les bases que les fonctionnalités avancées de JavaScript.",
    "totalCopies": 121,
    "availableCopies": 120,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_l0umqa2H6.png",
    "summary": "L'ouvrage débute par une introduction aux concepts de programmation avant de passer aux fondamentaux de JavaScript (variables, fonctions, structures de contrôle). Il aborde ensuite des sujets avancés tels que les closures, la programmation asynchrone et la conception orientée objet, tout en explorant l'écosystème JavaScript (API navigateur, Node.js, nouveautés du langage).\n\nUne caractéristique particulière de ce livre est son accent sur l'écriture d'un code élégant, propre et efficace, accompagné d'exercices pratiques et de projets (comme la création d'un jeu ou d'un mini-langage de programmation) pour consolider les acquis."
  },
  {
    "id": "383a8140-08b8-4c7c-97a7-e1bc68dc1488",
    "title": "Fullstack React : Le guide complet de ReactJS et de ses outils",
    "author": "Accomazzo, Greif et Murray",
    "genre": "Développement Web",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_aiko1JtEn.png",
    "coverColor": "#eac8bf",
    "description": "« Fullstack React : Le guide complet de ReactJS et de ses outils » par Accomazzo, Greif et Murray est une ressource complète pour les développeurs souhaitant maîtriser React et construire des applications full-stack.",
    "totalCopies": 11,
    "availableCopies": 11,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_0HxM1wQe62.png",
    "summary": "Le livre propose des tutoriels pas à pas, des projets concrets et une analyse approfondie de l'écosystème React, en débutant par les fondamentaux (composants, état, props) et en évoluant vers des concepts plus avancés (cycle de vie, hooks, optimisation des performances). Il aborde également des outils clés tels que Redux, React Router et Webpack, et insiste sur les meilleures pratiques pour développer des applications réelles, tester son code (avec Next.js pour le rendu côté serveur) et déployer en production."
  },
  {
    "id": "cc625b42-6852-44af-b3a3-e668fa967b8e",
    "title": "Réussir l'entretien de codage",
    "author": "Gayle Laakmann McDowell",
    "genre": "Programmation",
    "rating": 4,
    "coverUrl": "https://ik.imagekit.io/pwd17k26p/books/covers/file_yryJFVYWd.png",
    "coverColor": "#97cc02",
    "description": "« Réussir l'entretien de codage » de Gayle Laakmann McDowell est un guide complet destiné aux ingénieurs logiciels se préparant aux entretiens techniques, regorgeant d'analyses, de stratégies et de plus de 180 questions de programmation simulant des situations d'entretien réelles.",
    "totalCopies": 32,
    "availableCopies": 32,
    "videoUrl": "https://ik.imagekit.io/pwd17k26p/books/videos/file_vcXsdjkqw.png",
    "summary": "Le livre guide le lecteur à travers le processus d'entretien technique en fournissant des conseils pour optimiser son CV, répondre aux questions comportementales et comprendre les attentes des recruteurs. Il décompose des problèmes complexes en parties gérables, expliquant les algorithmes, structures de données et techniques de codage nécessaires.\n\nUn des points forts réside dans l'approche stratégique pour aborder des sujets courants (tableaux, listes chaînées, arbres, graphes, programmation dynamique et conception de systèmes), ainsi que des conseils pour gérer le stress, communiquer efficacement et déboguer en temps réel, faisant de cet ouvrage un véritable outil de carrière."
  }
]
